
```
    Switch>en
    Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
    Switch(config)#hostname SW10-KAK-2042
    SW10-KAK-2042(config)#vlan 10
    SW10-KAK-2042(config-vlan)#name LAN-VPC-10
    SW10-KAK-2042(config-vlan)#vlan 20
    SW10-KAK-2042(config-vlan)#name LAN-VPC-20
    SW10-KAK-2042(config-vlan)#vlan 30
    SW10-KAK-2042(config-vlan)#name MGMT
    SW10-KAK-2042(config-vlan)#vlan 999
    SW10-KAK-2042(config-vlan)#name Parking_Lot
    SW10-KAK-2042(config-vlan)#vlan 1000
    SW10-KAK-2042(config-vlan)#name Native
    SW10-KAK-2042(config-vlan)#int e0/2
    SW10-KAK-2042(config-if)#switchport mode access
    SW10-KAK-2042(config-if)#switchport access vlan 20
    SW10-KAK-2042(config-if)#no sh
    SW10-KAK-2042(config-if)#int range e0/0-1
    SW10-KAK-2042(config-if-range)#sh
    SW10-KAK-2042(config-if-range)#chanel-group 1 mode passive
    SW10-KAK-2042(config-if-range)#no sh


    SW10-KAK-2042(config)#int e0/3
    SW10-KAK-2042(config-if)#switchport mode trunk
    Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
    SW10-KAK-2042(config-if)#switchport trunk encapsulation dot1q
    SW10-KAK-2042(config-if)#switchport mode trunk
    SW10-KAK-2042(config-if)#switchport trunk allowed vlan 10,20,30
    SW10-KAK-2042(config-if)#no sh
    SW10-KAK-2042(config-if)#end
    SW10-KAK-2042#wr
    SW10-KAK-2042(config)#int e0/2
    SW10-KAK-2042(config-if)#switchport mode access
    SW10-KAK-2042(config-if)#switchport access vlan 20
    SW10-KAK-2042(config-if)# no sh

    SW10-KAK-2042(config)#int range e0/0-1
    SW10-KAK-2042(config-if)#switchport mode trunk
    Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
    SW10-KAK-2042(config-if)#switchport trunk encapsulation dot1q
    SW10-KAK-2042(config-if)#switchport mode trunk
    SW10-KAK-2042(config-if)#switchport trunk allowed vlan 10,20,30
    SW10-KAK-2042(config-if)#no sh
    SW10-KAK-2042(config-if)#end
```
- Конфигурация
```
    hostname SW10-KAK-2042

    interface Port-channel1
    switchport trunk allowed vlan 10,20,30
    switchport trunk encapsulation dot1q
    switchport mode trunk
    !
    interface Ethernet0/0
    switchport trunk allowed vlan 10,20,30
    switchport trunk encapsulation dot1q
    switchport mode trunk
    channel-group 1 mode passive
    !
    interface Ethernet0/1
    switchport trunk allowed vlan 10,20,30
    switchport trunk encapsulation dot1q
    switchport mode trunk
    channel-group 1 mode passive
    !
    interface Ethernet0/2
    switchport access vlan 20
    switchport mode access
    !
    interface Ethernet0/3
    switchport trunk allowed vlan 10,20,30
    switchport trunk encapsulation dot1q
    switchport mode trunk
    !
    interface Ethernet1/0
    switchport access vlan 999
    switchport mode access
    shutdown
    !
    interface Ethernet1/1
    switchport access vlan 999
    switchport mode access
    shutdown
    !
    interface Ethernet1/2
    switchport access vlan 999
    switchport mode access
    shutdown
    !
    interface Ethernet1/3
    switchport access vlan 999
    switchport mode access
    shutdown

```
